Core/src/src/Documents/РС_ЭлектроннаяНакладная/РС_ЭлектроннаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РС_ЭлектроннаяНакладная</name>
  <posting>Deny</posting>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерУдостоверения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияУдостоверение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодительНеРезидент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомерАвтомобиля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоОтправитель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоПолучатель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отпустил</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <types>CatalogRef.Сотрудники</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получил</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <types>CatalogRef.Сотрудники</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID_ТН</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусТН</name>
    <type>
      <types>EnumRef.РС_СтатусыТН</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаТранспортировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктивации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставкиТН</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспортировки</name>
    <type>
      <types>EnumRef.РС_ВидыТранспортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийТН</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АсинхроннаяТН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТН</name>
    <type>
      <types>EnumRef.РС_ТипыТН</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплатыТранспортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДругойТранспорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НакладнаяДистрибюций</name>
    <type>
      <types>DocumentRef.ПеремещениеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикТранспортировкиТН</name>
    <type>
      <types>EnumRef.ПлательщикТранспортировкиТН</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПеремещениеЗапасов</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ЧекККМ</types>
        <types>DocumentRef.ПеремещениеВА</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДляРС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имущество</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоПодарок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыЭлНакладных</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>W_NAME</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UNIT_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UNIT_TXT</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>QUANTITY</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PRICE</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AMOUNT</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BAR_CODE</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>A_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VAT_TYPE</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>QUANTITY_EXT</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>STATUS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШапкаRS</name>
    <attributes>
      <name>ИмяПараметраRS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметраRS</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/Documents/РС_ЭлектроннаяНакладная/ManagerModule.bsl
#Область ИнтерфейсПечати

Функция СформироватьПечатнуюФормуТоварнаяНакладнаяRS(ТекущийДокумент) 
	
	ИспользоватьХарактеристики = Константы.ФункциональнаяОпцияИспользоватьХарактеристики.Получить();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РС_ЭлектроннаяНакладная_ПФ_MXL_ТоварнаяНакладнаяRS";
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СчетНаОплату_ПФ_MXL_ТоварнаяНакладнаяRS";
	//ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = истина;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РС_ЭлектроннаяНакладная.ПФ_MXL_ТоварнаяНакладнаяRS");
	
	ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьПриложение	= Макет.ПолучитьОбласть("Приложение");														
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");	
	ОбластьТовары		= Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьТовары2		= Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
	ОбластьПустаяСтрока		= Макет.ПолучитьОбласть("ПустаяСтрока");
	
	ОбластьТЧЛицензииНаВырубкуЛесаШапка  = Макет.ПолучитьОбласть("ТЧЛицензииНаВырубкуЛесаШапка"); 
	ОбластьТЧЛицензииНаВырубкуЛесаСтрока = Макет.ПолучитьОбласть("ТЧЛицензииНаВырубкуЛесаСтрока");
	ОбластьНомерТаблички                 = Макет.ПолучитьОбласть("НомерТаблички");
	ОбластьНадписьЛицензии               = Макет.ПолучитьОбласть("НадписьЛицензии");
	
	ТабличныйДокумент.Очистить();
	
	ВалютаРегл = Константы.НациональнаяВалюта.Получить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",                ТекущийДокумент.Ссылка);
	//Запрос.УстановитьПараметр("ДатаДокумента",		   ТекущийДокумент.Ссылка.Дата);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Константы.ЭлектроннаяНакладнаяДатуБратьИзДатыТранспортировки
	|			ТОГДА РС_ЭлектроннаяНакладная.ДатаНачалаТранспортировки
	|		ИНАЧЕ РС_ЭлектроннаяНакладная.ДатаАктивации
	|	КОНЕЦ КАК ДатаПоставки,
	|	РС_ЭлектроннаяНакладная.НомерТН КАК НомерНакладной,
	|	РС_ЭлектроннаяНакладная.Дата КАК ДатаДокумента,
	|	""(დღგ–ს გადამხდელი)"" КАК ПлателщикНДС1,
	|	РС_ЭлектроннаяНакладная.Организация.НаименованиеПолное КАК Отправитель,
	|	РС_ЭлектроннаяНакладная.Организация.ИНН КАК ИННОтправителя,
	|	""(დღგ–ს გადამხდელი)"" КАК ПлателщикНДС2,
	|	РС_ЭлектроннаяНакладная.ГрузоПолучатель.НаименованиеПолное КАК Получатель,
	|	РС_ЭлектроннаяНакладная.ГрузоПолучатель.ИНН КАК ИННПолучателя,
	|	РС_ЭлектроннаяНакладная.ТипТН КАК ТипТТН,
	|	ВЫБОР
	|		КОГДА РС_ЭлектроннаяНакладная.АдресОтправки = """"
	|			ТОГДА ""Х""
	|		ИНАЧЕ РС_ЭлектроннаяНакладная.АдресОтправки
	|	КОНЕЦ КАК АдресНачалаТранспортировки,
	|	ВЫБОР
	|		КОГДА РС_ЭлектроннаяНакладная.ТипТН = ЗНАЧЕНИЕ(Перечисление.РС_ТипыТН.РеализацияБезТранспортировки)
	|			ТОГДА ""Х""
	|		ИНАЧЕ РС_ЭлектроннаяНакладная.АдресДоставки
	|	КОНЕЦ КАК АдресДоставки,
	|	ВЫБОР
	|		КОГДА РС_ЭлектроннаяНакладная.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.РС_ВидыТранспортировки.Прочее)
	|			ТОГДА РС_ЭлектроннаяНакладная.КомментарийТН
	|		ИНАЧЕ РС_ЭлектроннаяНакладная.ВидТранспортировки
	|	КОНЕЦ КАК ВидТранспортировки,
	|	ВЫБОР
	|		КОГДА РС_ЭлектроннаяНакладная.ТипТН = ЗНАЧЕНИЕ(Перечисление.РС_ТипыТН.РеализацияБезТранспортировки)
	|			ТОГДА ""Х""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РС_ЭлектроннаяНакладная.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.РС_ВидыТранспортировки.Прочее)
	|						ИЛИ РС_ЭлектроннаяНакладная.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.РС_ВидыТранспортировки.Железнодорожная)
	|						ИЛИ РС_ЭлектроннаяНакладная.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.РС_ВидыТранспортировки.Авиационная)
	|					ТОГДА ""Х""
	|				ИНАЧЕ РС_ЭлектроннаяНакладная.ГосНомерАвтомобиля
	|			КОНЕЦ
	|	КОНЕЦ КАК НомерТранспорта,
	|	ВЫБОР
	|		КОГДА РС_ЭлектроннаяНакладная.ТипТН = ЗНАЧЕНИЕ(Перечисление.РС_ТипыТН.РеализацияБезТранспортировки)
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РС_ЭлектроннаяНакладная.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.РС_ВидыТранспортировки.Прочее)
	|						ИЛИ РС_ЭлектроннаяНакладная.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.РС_ВидыТранспортировки.Железнодорожная)
	|						ИЛИ РС_ЭлектроннаяНакладная.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.РС_ВидыТранспортировки.Авиационная)
	|					ТОГДА """"
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РС_ЭлектроннаяНакладная.КомментарийТН = """"""""
	|							ТОГДА ""Х""
	|						ИНАЧЕ РС_ЭлектроннаяНакладная.КомментарийТН
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ОписаниеТранспортировки,
	|	ВЫБОР
	|		КОГДА РС_ЭлектроннаяНакладная.ТипТН = ЗНАЧЕНИЕ(Перечисление.РС_ТипыТН.РеализацияСТранспортировкой)
	|				И НЕ(РС_ЭлектроннаяНакладная.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.РС_ВидыТранспортировки.Автомобильная)
	|						ИЛИ РС_ЭлектроннаяНакладная.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.РС_ВидыТранспортировки.Автомобильная_Заграничная))
	|			ТОГДА ""Х""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РС_ЭлектроннаяНакладная.ТипТН = ЗНАЧЕНИЕ(Перечисление.РС_ТипыТН.РеализацияБезТранспортировки)
	|					ТОГДА ""Х""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РС_ЭлектроннаяНакладная.НомерУдостоверения = """"
	|							ТОГДА РС_ЭлектроннаяНакладная.Перевозчик.ИНН
	|						ИНАЧЕ РС_ЭлектроннаяНакладная.НомерУдостоверения
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ИННВодителя,
	|	РС_ЭлектроннаяНакладная.СуммаОплатыТранспортировки КАК РасходВодителя,
	|	РС_ЭлектроннаяНакладная.Отпустил КАК ОтправительТТН,
	|	РС_ЭлектроннаяНакладная.Получил КАК ПолучательТТН,
	|	РС_ЭлектроннаяНакладная.ДатаДоставкиТН КАК ДатаЗавершенияТранспортировки,
	|	РС_ЭлектроннаяНакладная.КомментарийТН КАК ПримечаниеТТН,
	|	РС_ЭлектроннаяНакладная.Прицеп
	|ИЗ
	|	Документ.РС_ЭлектроннаяНакладная КАК РС_ЭлектроннаяНакладная,
	|	Константы КАК Константы
	|ГДЕ
	|	РС_ЭлектроннаяНакладная.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(РС_ЭлектроннаяНакладнаяТовары.Сумма) КАК Сумма
	|ИЗ
	|	Документ.РС_ЭлектроннаяНакладная.Товары КАК РС_ЭлектроннаяНакладнаяТовары
	|ГДЕ
	|	РС_ЭлектроннаяНакладнаяТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РС_ЭлектроннаяНакладнаяТовары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РС_ЭлектроннаяНакладнаяТовары.Номенклатура.НаименованиеПолное КАК СТРОКА(1))) = "" ""
	|			ТОГДА РС_ЭлектроннаяНакладнаяТовары.Номенклатура.Наименование
	|		ИНАЧЕ РС_ЭлектроннаяНакладнаяТовары.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА РС_ЭлектроннаяНакладнаяТовары.Номенклатура.ОсновнойШтрихКод = """"
	|			ТОГДА РС_ЭлектроннаяНакладнаяТовары.Номенклатура.Код
	|		ИНАЧЕ РС_ЭлектроннаяНакладнаяТовары.Номенклатура.ОсновнойШтрихКод
	|	КОНЕЦ КАК Код1,
	|	ВЫБОР
	|		КОГДА РС_ЭлектроннаяНакладнаяТовары.Номенклатура.ЕдиницаИзмерения = РС_ЭлектроннаяНакладнаяТовары.ЕдиницаИзмерения
	|			ТОГДА РС_ЭлектроннаяНакладнаяТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ РС_ЭлектроннаяНакладнаяТовары.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	РС_ЭлектроннаяНакладнаяТовары.Количество,
	|	РС_ЭлектроннаяНакладнаяТовары.Цена КАК Цена,
	|	РС_ЭлектроннаяНакладнаяТовары.Сумма КАК Сумма,
	|	РС_ЭлектроннаяНакладнаяТовары.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР
	|		КОГДА РС_ЭлектроннаяНакладнаяТовары.Ссылка.Организация.СоответствиеНоменклатур = ЗНАЧЕНИЕ(Перечисление.СоответствияНоменклатуры.ПоШтрихкоду)
	|			ТОГДА РС_ЭлектроннаяНакладнаяТовары.Номенклатура.ОсновнойШтрихКод
	|		КОГДА РС_ЭлектроннаяНакладнаяТовары.Ссылка.Организация.СоответствиеНоменклатур = ЗНАЧЕНИЕ(Перечисление.СоответствияНоменклатуры.ПоАртикулу)
	|			ТОГДА РС_ЭлектроннаяНакладнаяТовары.Номенклатура.Артикул
	|		ИНАЧЕ РС_ЭлектроннаяНакладнаяТовары.Номенклатура.Код
	|	КОНЕЦ КАК Код,
	|	"""" КАК Код2
	|ИЗ
	|	Документ.РС_ЭлектроннаяНакладная.Товары КАК РС_ЭлектроннаяНакладнаяТовары
	|ГДЕ
	|	РС_ЭлектроннаяНакладнаяТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Выборка = Запрос.ВыполнитьПакет();
	ВыборкаШапка = Выборка[0].Выбрать();
	ВыборкаШапка.Следующий();
	ОбластьШапка.Параметры.Заполнить(ВыборкаШапка);
	Попытка
		ОбластьШапка.Параметры.Дата		= Формат(ТекущийДокумент.Ссылка.ДатаНачалаТранспортировки,	"ДФ=""дд/ММ/гггг"";L = ""ka"""); //ВыборкаШапка.ДатаПоставки
	Исключение
	КонецПопытки;
	Попытка
		ОбластьШапка.Параметры.Время	= Формат(ТекущийДокумент.Ссылка.ДатаНачалаТранспортировки,	"ДФ=""ЧЧ:мм:сс"";L = ""ka""");	
	Исключение
	КонецПопытки;	
	//Если Ссылка.СтатусТН = Перечисления.РС_СтатусыТН.Отмененный Тогда
	//	ДатаОтмены = ПолучитьДатуОтмены(Ссылка);
	//	Попытка
	//		ОбластьШапка.Параметры.ДатаОтмены	= "გაუქმების თარიღი: " + Формат(ДатаОтмены,	"ДФ=""дд/ММ/гггг"";L = ""ka""");
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	
	Попытка
		ОбластьШапка.Параметры.ИННВодителя = ВыборкаШапка.ИННВодителя + "  " +ВыборкаШапка.Перевозчик;
	Исключение
	КонецПопытки;
	
	//ВыводитьПресселера = МодульСтатическихДанных.ПолучитьВыводитьТорговогоПредставителяПриПечатиНакладной();
	//Если ВыводитьПресселера Тогда
	//	Попытка
	//		ОбластьШапка.Параметры.Преселлер = Строка(ВыборкаШапка.Преселлер);
	//	Исключение
	//	КонецПопытки;
	//Иначе
		Попытка
			ОбластьШапка.Параметры.Преселлер = "";
		Исключение
		КонецПопытки;
	//КонецЕсли;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	НалогообложениеКонтрагентаСрезПоследних.ВидНалогообложения
	//|ИЗ
	//|	РегистрСведений.НалогообложениеКонтрагента.СрезПоследних(&Период, Контрагент = &Контрагент) КАК НалогообложениеКонтрагентаСрезПоследних";
	
	//Запрос.УстановитьПараметр("Период", Ссылка.Дата);
	//Запрос.УстановитьПараметр("Контрагент", Ссылка.Контрагент);
	//Резултат = Запрос.Выполнить().Выбрать();
	//Если Резултат.Следующий() Тогда 
	//	Если Резултат.ВидНалогообложения = Перечисления.НалогообложениеНДС.ОблагаетсяНДС Тогда 
	//		Попытка
	//			ОбластьШапка.Параметры.ПлателщикНДС2 = "(დღგ–ს გადამხდელი)"; 	
	//		Исключение
	//		КонецПопытки;
	//	КонецЕсли;
	//Иначе 
	//	Попытка
			ОбластьШапка.Параметры.ПлателщикНДС2 = "(დღგ–ს გადამხდელი)";
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	
	//ОбластьШапка.Параметры.КатегорияНакладной = ?(ВыборкаШапка.КатегорияТН = Перечисления.КатегорииТТН.Лесопосадки, "ხე-ტყის", "");
	
//rajak	
	Если ТекущийДокумент.ТипТН = Перечисления.РС_ТипыТН.ВозвратОтПокупателя Тогда 
		
		 ОбластьШапка.Параметры.Отправитель = ТекущийДокумент.ГрузоОтправитель;
		 ОбластьШапка.Параметры.ИННОтправителя = ТекущийДокумент.ГрузоОтправитель.ИНН;
		 ОбластьШапка.Параметры.Получатель = ТекущийДокумент.ГрузоПолучатель;
		 ОбластьШапка.Параметры.ИННПолучателя = ТекущийДокумент.ГрузоПолучатель.ИНН;
		
	КонецЕсли;
//rajak	
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ВыгрузкаОбщаяСумма = Выборка[1].Выбрать();
	ВыгрузкаОбщаяСумма.Следующий();
	ОбщаяСумма = ?(ВыгрузкаОбщаяСумма.Сумма = Null, 0, ВыгрузкаОбщаяСумма.Сумма);
	
	
	ОбластьПодвал.Параметры.Заполнить(ВыборкаШапка);		
	Попытка
		ОбластьПодвал.Параметры.ОбщаяСумма = ?(ОбщаяСумма = 0, "0", ?(ОбщаяСумма >= 1, ?(ОбщаяСумма %Цел(ОбщаяСумма)= 0, Формат(ОбщаяСумма, "ЧЦ=15; ЧДЦ=0; ЧРД=.; ЧРГ=' '; ЧН=0"),
		Формат(ОбщаяСумма, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧРГ=' '; ЧН=0")),Формат(ОбщаяСумма, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧРГ=' '; ЧН=0")));
	Исключение
	КонецПопытки;
	Попытка
		ОбластьПодвал.Параметры.ОбщаяСуммаПрописью = СформироватьСуммуПрописьюБезЦифр(ОбщаяСумма, ВалютаРегл);	 
	Исключение
	КонецПопытки;
	
	Попытка
		ОбластьПодвал.Параметры.Тире ="-";		
	Исключение
	КонецПопытки;
	Попытка
		ОбластьПодвал.Параметры.НаименованиеОтправителя = ?(ВыборкаШапка.ОтправительТТН = Неопределено, "", ?(ЗначениеЗаполнено(ВыборкаШапка.ОтправительТТН.Должность), Строка(ВыборкаШапка.ОтправительТТН.Должность) + ", ", "")+ ВыборкаШапка.ОтправительТТН.Наименование); 
	Исключение
		ОбластьПодвал.Параметры.НаименованиеОтправителя = ВыборкаШапка.ОтправительТТН;
	КонецПопытки;
	Попытка
		ОбластьПодвал.Параметры.НаименованиеПолучателя  = ?(ВыборкаШапка.ПолучательТТН = Неопределено,  "", ?(ЗначениеЗаполнено(ВыборкаШапка.ПолучательТТН.Должность),  Строка(ВыборкаШапка.ПолучательТТН.Должность) + ", ", "") + ВыборкаШапка.ПолучательТТН.Наименование);
	Исключение
		ОбластьПодвал.Параметры.НаименованиеПолучателя  = ВыборкаШапка.ПолучательТТН;
	КонецПопытки;
	Если ТекущийДокумент.СтатусТН = Перечисления.РС_СтатусыТН.Завершеная Тогда 
		Попытка
			ОбластьПодвал.Параметры.ДатаЗавершения			= Формат(ВыборкаШапка.ДатаЗавершенияТранспортировки,	"ДФ=""дд/ММ/гггг"";L = ""ka""");
		Исключение
		КонецПопытки;
		Попытка
			ОбластьПодвал.Параметры.ВремяЗавершения			= Формат(ВыборкаШапка.ДатаЗавершенияТранспортировки,	"ДФ=""ЧЧ:мм:сс"";L = ""ka""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	Попытка
		ОбластьПодвал.Параметры.ВремяПечати				= Формат(ТекущаяДата(), "ДФ=""дд/ММ/гггг, ЧЧ:мм:сс"";L = ""ka""");
	Исключение
	КонецПопытки;
	Попытка
		ОбластьПодвал.Параметры.ПримечаниеТТН = ТекущийДокумент.КомментарийТН;
	Исключение
	КонецПопытки;
	
	Попытка
		ОбластьПриложение.Параметры.Приложения = ВыборкаШапка.НомерНакладной + " სასაქონლო ზედნადების დანართი";
	Исключение
	КонецПопытки;
	
	ТаблицаТовары = Выборка[2].Выгрузить();	
	
	Если ТаблицаТовары.Количество() = 0 Тогда
		ТабличныйДокумент.Вывести(ОбластьТовары);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
	Иначе	
		МассивСтрок = Новый Массив; 
		МассивСтрок.Очистить();
		МассивСтрок.Добавить(ОбластьТовары);
		МассивСтрок.Добавить(ОбластьТовары2);
		МассивСтрок.Добавить(ОбластьПустаяСтрока);
		МассивСтрок.Добавить(ОбластьПустаяСтрока);
		
		//МассивСтрок.Добавить(ОбластьПодвал);		
		КоличествоТоваров = ТаблицаТовары.Количество();	
		Для Каждого ВыборкаТовары Из ТаблицаТовары Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			Попытка
				ОбластьТовары.Параметры.Номенклатура = Строка(ВыборкаТовары.Номенклатура) + ?(ИспользоватьХарактеристики, ?(ЗначениеЗаполнено(ВыборкаТовары.ХарактеристикаНоменклатуры), ", " + Строка(ВыборкаТовары.ХарактеристикаНоменклатуры), ""), "");
			Исключение
			КонецПопытки;
			Если НЕ КоличествоТоваров = 1 Тогда
				ОбластьТовары2.Параметры.Заполнить(ТаблицаТовары[ТаблицаТовары.Количество() - КоличествоТоваров + 1]);						
				Попытка
					ОбластьТовары2.Параметры.Номенклатура = Строка(ВыборкаТовары.Номенклатура) + ?(ИспользоватьХарактеристики, ?(ЗначениеЗаполнено(ВыборкаТовары.ХарактеристикаНоменклатуры), ", " + Строка(ВыборкаТовары.ХарактеристикаНоменклатуры), ""), "");
				Исключение
				КонецПопытки;
			КонецЕсли;
			Если ТабличныйДокумент.ПроверитьВывод(МассивСтрок) Тогда
				ТабличныйДокумент.Вывести(ОбластьТовары);
				КоличествоТоваров = КоличествоТоваров - 1;
				//Если КоличествоТоваров = 6 Тогда
				//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				//	ТабличныйДокумент.Вывести(ОбластьПриложение);
				//	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
				//КонецЕсли;	 
			Иначе
				//ТабличныйДокумент.Вывести(ОбластьПодвал);
				//ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьПриложение);	
				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
				ТабличныйДокумент.Вывести(ОбластьТовары);
				КоличествоТоваров = КоличествоТоваров - 1;
			КонецЕсли;
			Если КоличествоТоваров = 0 Тогда
				ТабличныйДокумент.Вывести(ОбластьПодвал);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
		
	Возврат ТабличныйДокумент
	
КонецФункции


// Функция формирует печатную форму документа по указанному макету.
//
// Параметры:
//	ТабличныйДокумент - ТабличныйДокумент в который будет выводится печатная
//				   форма.
//  ИмяМакета    - Строка, имя макета печатной формы.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_РС_ЭлектроннаяНакладная";
	
	ПервыйДокумент = Истина;
	
	Если ИмяМакета = "ТоварнаяНакладнаяRS" Тогда
		
	КонецЕсли;
	
	Для каждого ТекущийДокумент Из МассивОбъектов Цикл
	
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ИмяМакета = "ТоварнаяНакладнаяRS" Тогда
					
			ТабличныйДокумент.Вывести(СформироватьПечатнуюФормуТоварнаяНакладнаяRS(ТекущийДокумент));
				
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТоварнаяНакладнаяRS") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТоварнаяНакладнаяRS", НСтр("ka='სასაქონლო ზედნადების ცხრილი';ru='Товарная накладная RS';en='Waybill RS'"), ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ТоварнаяНакладнаяRS"));
		
	КонецЕсли;
	
	// параметры отправки печатных форм по электронной почте
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// ТоварнаяНакладнаяRS
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТоварнаяНакладнаяRS";
	КомандаПечати.Представление = НСтр("ka='სასაქონლო ზედნადების ცხრილი';ru='Товарная накладная RS';en='Waybill RS'");
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьСтруктуруЭлНакладных(Знач ДокументОбъект) Экспорт
	
	СтруктураТН = Новый Структура;	
	СтруктураТН.Вставить("Объект",						 	 ДокументОбъект.Ссылка);
	СтруктураТН.Вставить("Организация",						 ДокументОбъект.Организация);
	СтруктураТН.Вставить("Документ",						 ДокументОбъект.ДокументыОснования[0].ДокументОснование);
	СтруктураТН.Вставить("СтатусТН",						 ДокументОбъект.СтатусТН);
	СтруктураТН.Вставить("ID_ТН",							 ДокументОбъект.ID_ТН);
	СтруктураТН.Вставить("ТаблицаТоваровЭлНакладных",		 ДокументОбъект.ТоварыЭлНакладных.Выгрузить());
	СтруктураТН.Вставить("ТаблицаШапкаRS",		 			 ДокументОбъект.ШапкаRS.Выгрузить());

	//+++ Дмгг
	// проверка-костыль, походу при обмене не во всех случаях заполняется отправитель/получатель
	ОтправительПолучатель = ДокументОбъект.ГрузоПолучатель; 
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.ГрузоОтправитель) Тогда 
		Если ДокументОбъект.ДокументыОснования.Количество() > 0 Тогда 
			Для Каждого Строк Из ДокументОбъект.ДокументыОснования Цикл 
				Если ЗначениеЗаполнено(Строк.ДокументОснование) Тогда 
					ОтправительПолучатель = Строк.ДокументОснование.Контрагент;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Элем Из СтруктураТН.ТаблицаШапкаRS Цикл 
		
		Если Элем.ИмяПараметраRS = "BUYER_TIN" И НЕ ЗначениеЗаполнено(Элем.ЗначениеПараметраRS) Тогда 
			Элем.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(ОтправительПолучатель), СокрЛП(ОтправительПолучатель.ИНН), "");
		ИначеЕсли Элем.ИмяПараметраRS = "CHEK_BUYER_TIN" И НЕ ЗначениеЗаполнено(Элем.ЗначениеПараметраRS) Тогда 
			Элем.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(ОтправительПолучатель), ?(ОтправительПолучатель.ЯвляетсяНеРезидентом,0,1), 0);
		ИначеЕсли Элем.ИмяПараметраRS = "BUYER_NAME" И НЕ ЗначениеЗаполнено(Элем.ЗначениеПараметраRS) Тогда
			Элем.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(ОтправительПолучатель), ОтправительПолучатель.Наименование, "");
		КонецЕсли;		
		
	КонецЦикла;
	//--- Дмгг
	
	Возврат СтруктураТН;

КонецФункции

Функция ПолучитьТоварыЭлНакладных(ТоварыЭлНакладных)
	
		
КонецФункции

Функция ОпределитьТипТН(ТипТН) Экспорт
	
	ТипНакладной = 0;
	Если ТипТН = Перечисления.РС_ТипыТН.ВнутреннееПеремещение Тогда 
		ТипНакладной = 1;
	ИначеЕсли ТипТН = Перечисления.РС_ТипыТН.РеализацияСТранспортировкой Тогда 
		ТипНакладной = 2;
	ИначеЕсли ТипТН = Перечисления.РС_ТипыТН.РеализацияБезТранспортировки Тогда 
		ТипНакладной = 3;
	ИначеЕсли ТипТН = Перечисления.РС_ТипыТН.Дистрибуция Тогда 
		ТипНакладной = 4;
	ИначеЕсли ТипТН = Перечисления.РС_ТипыТН.ВозвратОтПокупателя Тогда 
		ТипНакладной = 5;
	ИначеЕсли ТипТН = Перечисления.РС_ТипыТН.ПодчиненнаяТН Тогда 
		ТипНакладной = 6;
	КонецЕсли;
	
	Возврат ТипНакладной;
	
КонецФункции

Функция ПолучитьВидТранспортировкиЭл(ТипТН, ВидТранспортировки, Прицеп, ДругойТранспорт, TRANS_ID, TRANS_TXT) Экспорт 
	
	TRANS_ID = 0;
	TRANS_TXT = "";
	Если ТипТН = Перечисления.РС_ТипыТН.РеализацияБезТранспортировки Тогда 
		TRANS_ID = 0;
	ИначеЕсли ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Автомобильная Тогда 
		TRANS_ID = 1;
		TRANS_TXT = Прицеп;
	ИначеЕсли ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Железнодорожная Тогда
		TRANS_ID = 2;
	ИначеЕсли ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Авиационная Тогда
		TRANS_ID = 3;
	ИначеЕсли ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Автомобильная_Заграничная Тогда
		TRANS_ID = 6;
		TRANS_TXT = Прицеп;
	ИначеЕсли ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Перегрузчик_Автомобильная Тогда
		TRANS_ID = 7;
		TRANS_TXT = Прицеп;
	Иначе 		
		TRANS_ID	= 4;
		TRANS_TXT	= ДругойТранспорт;
	КонецЕсли;

	
КонецФункции

Функция СформироватьСуммуПрописьюБезЦифр(Сумма, Валюта)
	
	//Если Валюта.ПараметрыПрописи = "" Тогда
	//	Возврат ФорматСумм(Сумма);                           
	//Иначе                                          		
		Если Валюта.ПараметрыПрописиНаРусском = "" Тогда
			Возврат ФорматСумм(Сумма);
		Иначе
			лСтрока = СтрЗаменить(Валюта.ПараметрыПрописиНаРусском, ",", Символы.ПС);
			ФормСтрока = "Л = ka_RU; ДП = Истина";				
			ПараметрыПрописи = СтрПолучитьСтроку(лСтрока, 1) + ", " + СтрПолучитьСтроку(лСтрока, 5);
			Возврат ЧислоПрописью(Сумма, ФормСтрока, ПараметрыПрописи);
		КонецЕсли;
	//КонецЕсли;                                          
	
КонецФункции

Функция ФорматСумм(Сумма, Валюта = Неопределено, ЧН = "", ЧРГ = "")
	
	ФорматнаяСтрока = "ЧЦ=15;ЧДЦ=2" +
	?(ПустаяСтрока(ЧН), "", ";" + "ЧН=" + ЧН) +
	?(ПустаяСтрока(ЧРГ),"", ";" + "ЧРГ=" + ЧРГ);
	РезультирующаяСтрока = СокрЛ(Формат(Сумма, ФорматнаяСтрока));
	
	Если Валюта <> Неопределено Тогда
		РезультирующаяСтрока = РезультирующаяСтрока + " " + СокрП(Валюта);		
	КонецЕсли;
	
	Возврат РезультирующаяСтрока;
	
КонецФункции
